export function TermsOfUseDescription() {
  return (
    <>
      <h3 className="text-black">제1조 (목적)</h3>
      이 약관은 '우리' (이하 '회사' 라고 합니다)가 제공하는 제반 서비스의 이용과 관련하여 회사와 회 원과의 권리, 의무 및
      책임 사항, 기타 필요한 사항을 규정함을 목적으로 합니다.
      <br />
      <br />
      <h3 className="text-black">제2조 (정의)</h3> 이 약관에서 사용하는 주요 용어의 정의는 다음과 같습니다.
      <br />
      1. ‘서비스'라 함은 구현되는 단말기와 상관없이 '이용자'가 이용할 수 있는 회사가 제공하는 제반 서비스를 의미합니다.
      <br />
      2. '이용자'란 이 약관에 따라 회사가 제공하는 서비스를 받는 '개인 회원'을 말합니다. <br />
      3. '회원'은 회사에 개인 정보를 제공하여 회원 등록을 한 사람으로, 회사로부터 지속적으로 정보를 제공받고 '회사'가
      제공하는 서비스를 계속적으로 이용할 수 있는 자를 말합니다. <br />
      4. '계정'이라 함은 회원의 식별과 서비스 이용을 위하여 회원이 정한 타사로부터 회사가 요청한 정보를 기반으로 한
      ‘아이디’와 ‘비밀번호’를 의미합니다. <br />
      5. '게시글'이란 정보통신망법의 규정에 따라 정보통신망에서 사용되는 부호, 문자, 이미지로 정보 형태의 글, 사진,
      동영상 및 각종 파일과 링크 등을 말합니다.
      <br />
      <br />
      <h3 className="text-black">제3조 (약관 외 준칙)</h3>이 약관에서 정하지 아니한 사항에 대해서는 법령 또는 회사가
      정한 서비스의 개별 약관, 운영 정책 및 규칙 등 (이하 세부 지침)의 규정에 따릅니다. 또한 본 약관과 세부 지침이
      충돌할 경우 에는 세부 지침에 따릅니다.
      <br />
      <br />
      <h3 className="text-black">제4조 (약관의 효력과 변경)</h3>
      1. 이 약관은 '우리'가 제공하는 모든 인터넷 서비스에 게시하여 공시합니다. 회사는 전자상거래 등에서의 소비자보호에
      관한 법률, 약관의 규제에 관한 법률, 정보통신망 이용 촉진 및 정보 보호 등에 관한 법률 등 본 서비스와 관련된 법령에
      위배되지 않는 범위에서 이 약관을 변경할 수 있습니다.
      <br />
      2. 회사는 약관이 변경되는 경우에 변경된 약관의 내용과 시행일을 정하여, 그 시행일로부터 최소 7일 (이용자에게
      불리하거나 중대한 사항의 변경은 30 일) 이 전부터 공지합니다. 변경된 약관은 공지하거나 통지한 시행일로부터 효력이
      발생합니다.
      <br />
      3. 이용자가 제2항의 공지일 또는 통지를 받은 날로부터 7일 (또는 이용자에게 불리하거나 중대한 사항의 변경인 경우에는
      30일) 내에 변경된 약관에 대해 거절의 의사를 표시하지 않았을 때에는 본 약관의 변경에 동의한 것으로 간주합니다.
      <br />
      <br />
      <h3 className="text-black">제5조 (이용 계약의 체결)</h3> 이용 계약은 이용자가 회원으로 가입하고자 하는 경우
      이용자가 약관의 내용에 대하여 동의를 한 다음 회원 가입 신청을 하고 회사가 이러한 신청에 대하여 승낙한 때
      체결됩니다.
      <br />
      <br />
      <h3 className="text-black">제6조 (회원 가입에 대한 승낙)</h3>
      1. 회사는 이용계약에 대한 요청이 있을 때 서비스 이용을 승낙함을 원칙으로 합니다.
      <br />
      2. 제1항에 따른 신청에 있어 회사는 서비스 제공에 필요한 경우 전문 기관을 통한 실명 확인 및 본인 인증을 요청할 수
      있습니다.
      <br />
      3. 제1항에 따른 신청에 있어 회사는 정해둔 타 서비스를 통해 이용자의 동의에 기반하여 이용자의 개인 정보를 전달받을
      수 있습니다.
      <br />
      4. 회사는 서비스 관련 설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다.
      <br />
      5, 이용계약의 성립 시기는 회사가 가입완료를 신청 절차상에서 표시한 시점으로 합니다.
      <br />
      <br />
      <h3 className="text-black">제7조 (회원 정보의 관리 및 보호)</h3> 1. 회원의 아이디와 비밀번호에 관한 관리 책임은
      회원에게 있으며, 계정 및 계정에 속한 개인정보 관련 문제는 간편가입을 진행한 서비스와 해결하여야 합니다.
      <br />
      2. 회사는 회원의 이름이 반사회적 또는 미풍양속에 어긋나거나, 회사 또는 서비스의 운영자로 오인할 우려가 있는 경우,
      해당 이름의 이용을 제한할 수 있습니다.
      <br />
      <br />
      <h3 className="text-black">제8조 (회사의 의무)</h3> 1. 회사는 부득이한 경우, 예고 없이 서비스의 전부 또는 일부의
      제공을 일시 중지할 수 있습니다. 이 경우, 그 사유 및 중지 기간 등을 이용자에게 사후 공지합니다.
      <br />
      2. 회사는 이용 계약의 체결, 계약 사항의 변경 및 해지 등 이용자와의 계약 관련 절차 및 내용 등에 있어 이용자에게
      편의를 제공하도록 노력합니다.
      <br />
      3. 회사는 이용약관, 개인정보 취급방침 등을 이용자가 쉽게 알 수 있도록 회원가입 화면에 게시합니다.
      <br />
      <br />
      <h3 className="text-black">제9조 (개인정보보호)</h3> 1. 회사가 이용자의 개인정보의 보호 및 사용에 대해서 관련 법규
      및 회사의 개인정보 처리방침을 적용합니다.
      <br />
      2. 회사는 최종 사용일로부터 연속하여 1년 동안 서비스 사용 이력이 없는 경우 법 시행령의 규정에 따라 이용자 정보를
      다른 이용자의 개인정보와 분리하여 별도로 저장 및 관리할 수 있습니다. 이때 분리 저장된 이용자의 개인정보는 이용자가
      회원 탈퇴 신청 또는 개인 정보 삭제 요청을 할 때까지 보관됩니다.
      <br />
      <br />
      <h3 className="text-black">제10조 (이용자의 의무)</h3> 1. 이용자는 본 약관에서 규정하는 사항과 회사가 공지하는
      사항을 준수하여야 합니다. 또한 이용자는 회사의 업무를 방해하는 행위 및 회사의 명예를 훼손하는 행위를 하여서는 안
      됩니다.
      <br />
      2. 이용자가 이름을 선정할 때에는 다음 각 호에 해당하는 행위를 해서는 안 됩니다.
      <br />
      가. 선정적이고 음란한 내용이 포함된 명칭을 사용하는 행위
      <br />
      나. 기타 반사회적이고 관계 법령에 저촉되는 내용이 포함된 명칭을 사용하는 행위
      <br />
      3. 본 조와 관련하여 서비스 이용에 있어 주의사항 등 그 밖의 내용은 운영 정책으로 정하며, 이용자가 이를 위반하는
      경우 이용 제한, 민형사상의 책임 등 불이익이 발생할 수 있습니다.
      <br />
      <br />
      <h3 className="text-black">제11조 (서비스의 제공)</h3> 1. 서비스에 대한 구체적인 안내는 개별 서비스 화면에서
      확인할 수 있습니다.
      <br />
      2. 서비스의 내용은 다음과 같습니다.
      <br />
      가. '가족'이라 칭해지는 모임을 생성할 수 있습니다.
      <br />
      나. 가족의 구성원인 '멤버'를 초대하거나 내보낼 수 있습니다.
      <br />
      다. 가족 내에서 글과 사진을 게시하고, 게시글에 대한 댓글과 반응을 남길 수 있습니다.
      <br />
      3. 무료 서비스는 회사의 운영 정책 등의 사유로 서비스의 전부 또는 일부가 제한되거나 중지될 수 있으며, 유료로 전환될
      수 있습니다.
      <br />
      <br />
      <h3 className="text-black">제12조 (탈퇴 절차)</h3>
      1. 이용자가 이용 계약을 해지하고자 할 때는 언제든지 탈퇴 신청을 통해 이용 계약 해지를 요청할 수 있습니다.
      <br />
      2. 회사는 이용자가 비정상적인 이용 또는 부당한 이용과 타인의 명예를 훼손하거나 모욕하는 게시물을 작성한 경우,
      이용자에게 통지하고 계약을 해지할 수 있습니다.
      <br />
      <br />
      <h3 className="text-black">제13조 (손해 배상)</h3> 1. 회사 또는 이용자는 상대방의 귀책에 따라 손해가 발생하는 경우
      손해배상을 청구할 수 있습니다. 다만, 회사는 무료 서비스의 장애, 제공 중단, 보관된 자료 멸실 또는 삭제, 변조 등으로
      인한 손해에 대하여는 배상 책임을 부담하지 않습니다.
      <br />
      2. 회사가 제공하는 서비스의 이용과 관련하여 회사의 운영 정책 및 개인 정보 보호 정책, 기타 서비스 별 이용 약관에서
      정하는 내용에 위반하지 않는 한 회사는 어떠한 손해에 대하여도 책임을 부담하지 않습니다.
      <br />
      <br />
      <h3 className="text-black">제14조 (정보의 제공 및 광고의 게재)</h3> 1. 회사는 이용자가 서비스 이용 중 필요하다고
      인정되는 각종 정보 및 광고, 알림을 배너 게재, 전자 우편, 메시지, 팝업 알림 등의 방법으로 이용자에게 제공할 수
      있습니다. 다만, 이용자는 이를 원하지 않을 경우 회사가 제공하는 방법에 따라 수신을 거부할 수 있습니다.
      <br />
      2. 이용자가 수신 거부를 한 경우에도 이용 약관, 개인정보 보호정책, 기타 이용자의 이익에 영향을 미칠 수 있는 중요한
      사항의 변경 등에 대한 사항은 정보를 제공할 수 있습니다.
      <br />
      3. 회사는 ‘정보통신망법’ 시행령에 따라 2년 마다 영리 목적의 광고성 정보 전송에 대한 수신 동의 여부를 확인합니다.
      <br />
      <br />
      <h3 className="text-black">제15조 (권리의 귀속)</h3> 1. 회사가 제공하는 서비스에 대한 저작권 등 지식재산권은
      회사에 귀속됩니다.
      <br />
      2. 회사는 서비스와 관련하여 이용자에게 회사가 정한 조건에 따라 회사가 제공하는 서비스를 이용할 수 있는 권한만을
      부여합니다.
      <br />
      3, 제1항의 규정에도 불구하고 이용자가 직접 작성한 게시글에 대한 지식재산권은 회사에 귀속되지 않습니다.
      <br />
      <br />
      <h3 className="text-black">제16조 (게시글의 저작권)</h3> 1. 이용자가 서비스 내에 게시한 콘텐츠의 저작권은 해당
      콘텐츠의 저작자에게 귀속됩니다.
      <br />
      2. 제1항에 불구하고 회사는 서비스의 운영, 홍보 등의 목적으로 별도의 허락없이 무상으로 다음 각 호와 같이 회원이
      등록한 콘텐츠를 사용할 수 있습니다.
      <br />
      가. 서비스 내에서 이용자가 작성한 콘텐츠의 복제, 수정, 전시, 전송, 배포 등 저작권을 침해하지 않는 범위 내의 2차적
      저작물 또는 편집 저작물 작성을 위한 사용. 다만, 해당 콘텐츠를 등록한 이용자가 해당 콘텐츠의 삭제 또는 사용 중지를
      요청하는 경우 회사는 관련 법에 따라 보존해야 하는 사항을 제외하고 관련 콘텐츠를 모두 삭제 또는 사용 중지합니다.
      <br />
      나. 서비스의 운영, 홍보, 서비스 개선 및 새로운 서비스 개발을 위한 범위 내의 사용 제17조 (관할 법원 및 준거법)
      서비스와 관련하여 분쟁이 발생한 경우 관할 법원은 민사소송법에 따른 관할 법원으로 정하며, 준거법은 대한민국의
      법령을 적용합니다.
      <br />
      <br />
      <h3 className="text-black">제18조 (기타) 1. 본 방침은 2024.07.29.부터 시행됩니다.</h3>
    </>
  );
}

export function PrivacyPolicyDescription() {
  return (
    <>
      <h3 className="text-black">제1조 (목적)</h3>
      우리 (이하 '회사'라고 함)는 회사가 제공하고자 하는 서비스 (이하 '회사 서비스’를 이용하는 개 인 (이하 "이용자’ 또는
      '개인')의 정보 (이하 '개인정보’)를 보호하기 위해, 개인정보 보호법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률
      (이하 '정보통신망법') 등 관련 법령을 준수하기 위하여 다음과 같이 개인정보 처리방침 (이하 '본 방침')을 수립합니다.
      <br />
      <br />
      <h3 className="text-black">제2조 (개인정보 처리의 원칙)</h3>
      개인정보 관련 법령 및 본 방침에 따라 회사는 이용자의 개인정보를 수집할 수 있으며, 수집된 개인정보는 개인의 동의가
      있거나 적법하게 강제되는 경우에 제3자에게 제공될 수 있습니다.
      <br />
      <br />
      <h3 className="text-black">제3조 (본 방침의 공개)</h3>
      회사는 이용자가 회원가입 시, 본 방침을 확인할 수 있도록 공개하고 있습니다.
      <br />
      <br />
      <h3 className="text-black">제4조 (본 방침의 변경)</h3>
      1. 본 방침은 개인정보 관련 법령, 지침, 고시 또는 정부나 회사 서비스의 정책이나 내용의 변경에 따라 개정될 수
      있습니다.
      <br />
      2. 회사는 제1항에 따라 본 방침을 개정하는 경우 다음 각 호 하나 이상의 방법으로 공지합니다.
      <br />
      가. 회사가 운영하는 서비스 내에서 별도의 창을 통하여 공지하는 방법
      <br />
      나. 전자 우편, 메시지와 비슷한 방법으로 이용자에게 공지하는 방법
      <br />
      3. 회사는 제2항의 공지는 본 방침 개정의 시행일로부터 최소 7일 이전에 공지합니다. 다만, 이용자 권리의 중요한 변경이
      있을 경우에는 최소 30일 전에 공지합니다.
      <br />
      <br />
      <h3 className="text-black">제5조 (회원 가입을 위한 정보)</h3>
      회사는 이용자의 회사 서비스에 대한 회원가입을 위하여 다음과 같은 정보를 수집 혹은 타 서비스에서 제공받습니다.
      <br />
      1 필수 수집 정보: 이름(닉네임), 프로필 사진, 생년월일(혹은 생년), 휴대폰 번호
      <br />
      2. 선택 수집 정보: 이메일 주소, 성별
      <br />
      <br />
      <h3 className="text-black">제6조 (법정대리인 동의를 위한 정보)</h3>
      회사는 법정대리인의 동의가 필요한 경우 법정대리인의 동의를 위하여 다음과 같은 정보를 수집합니다.
      <br />
      1. 필수 수집 정보: 보호자 이름, 보호자 휴대폰 번호 및 이동통신사 정보, 보호자 본인확인값(CI,DI)
      <br />
      <br />
      <h3 className="text-black">제7조 (서비스 이용 및 부정 이용 확인을 위한 정보)</h3>
      회사는 이용자의 서비스 이용에 따른 통계 분석 및 부정이용의 확인 분석을 위하여 다음과 같은 정보를 수집할 수도
      있습니다. (부정 이용이란, 명의 도용 등의 불법 행위 등을 말합니다.)
      <br />
      1. 수집 정보: 서비스 이용 기록, 기기 정보
      <br />
      <br />
      <h3 className="text-black">제8조 (개인정보 수집 방법)</h3>
      회사는 다음과 같은 방법으로 이용자의 개인정보를 수집합니다.
      <br />
      1. 회사가 제공하고 이용자가 선택한 타 서비스를 통해 이용자가 자신의 개인정보를 전달하는 방식
      <br />
      2. 이용자가 회사의 서비스를 이용하는 과정에서 이용자가 입력하는 방식
      <br />
      <br />
      <h3 className="text-black">제9조 (개인정보의 이용)</h3>
      회사는 개인정보를 다음 각 호의 경우에 이용합니다.
      <br />
      1. 공지사항의 전달, 이용 문의에 대한 회신 등 회사 운영에 필요한 경우
      <br />
      2. 회사의 서비스를 제공하기 위한 경우
      <br />
      3. 법령 및 회사 약관을 위반하는 회원에 대한 방지 및 제재를 위한 경우
      <br />
      4. 신규 서비스 개발을 위한 경우
      <br />
      5. 이벤트 및 행사 안내 등 마케팅을 위한 경우
      <br />
      6. 인구통계학적 분석, 서비스 방문 및 이용기록의 분석을 위한 경우
      <br />
      <br />
      <h3 className="text-black">제10조 (개인정보의 보유 및 이용 기간)</h3>
      1. 회사는 이용자의 개인정보에 대해 개인정보의 수집·이용 목적 달성을 위한 기간 동안 개인정보를 보유 및 이용합니다.
      <br />
      2. 전 항에도 불구하고 회사는 내부 방침에 의해 부정 가입 및 이용 방지를 위하여 회원 탈퇴 시 점으로부터 최대 1년 간
      보관할 수도 있습니다.
      <br />
      <br />
      <h3 className="text-black">제11조 (법령에 따른 개인정보의 보유 및 이용 기간)</h3>
      회사는 관계법령에 따라 다음과 같이 개인정보를 보유 및 이용합니다.
      <br />
      1. 전자상거래 등에서의 소비자 보호에 관한 법률에 따른 보유 정보 및 보유 기간
      <br />
      가. 계약 또는 청약 철회 등에 관한 기록: 1년
      <br />
      나. 소비자의 불만 또는 분쟁 처리에 관한 기록: 1년
      <br />
      다. 표시·광고에 관한 기록: 6개월
      <br />
      2. 통신 비밀보호법에 따른 보유 정보 및 보유 기간
      <br />
      가. 웹 사이트 로그 기록 자료: 1년
      <br />
      <br />
      <h3 className="text-black">제12조 (개인정보의 파기 원칙)</h3>
      회사는 원칙적으로 이용자의 개인정보 처리 목적의 달성, 보유·이용 기간의 경과 등 개인정보가 필요하지 않을 경우에는
      해당 정보를 지체 없이 파기합니다.
      <br />
      <br />
      <h3 className="text-black">제13조 (개인정보 파기 절차)</h3>
      1. 이용자가 회원가입 등을 위해 제공한 정보는 개인정보 처리 목적이 달성된 후 별도의 DB로 옮겨져 내부 방침 및 기타
      관련 법령에 의한 정보 보호 사유에 따라 일정 기간 저장된 후 파기되어집니다.
      <br />
      2. 회사는 파기 사유가 발생한 개인정보를 개인정보 보호 책임자의 승인을 거쳐 파기합니다.
      <br />
      3. 개인정보는 전자적 파일에 저장되며, 추후 복구되지 않는 방법을 통해 파기합니다.
      <br />
      <br />
      <h3 className="text-black">제14조 (광고성 정보의 전송 조치)</h3>
      1. 회사는 전자적 전송 매체를 이용하여 영리 목적의 광고성 정보를 전송하는 경우 이용자의 명시적인 사전 동의를
      받습니다.
      <br />
      2. 회사는 전자적 전송 매체를 이용하여 영리 목적의 광고성 정보를 전송하는 경우 다음의 사항 등을 광고성 정보에
      구체적으로 밝힙니다.
      <br />
      가. 회사명
      <br />
      나. 수신 거부 또는 수신 동의의 철회 의사표시에 관한 사항의 표시
      <br />
      <br />
      <h3 className="text-black">제15조 (이용자의 의무)</h3>
      타인의 개인정보를 도용한 회원가입의 경우 이용자 자격을 상실하거나 관련 개인정보 보호 법령에 의해 처벌받을 수
      있습니다.
      <br />
      <br />
      <h3 className="text-black">제16조 (개인정보 유출 등에 대한 조치)</h3>
      회사는 개인정보의 분실, 도난, 유출 (이하 "유출 등" 이라 한다) 사실을 안 때에는 지체 없이 다음 각 호의 모든 사항을
      해당 이용자에게 알리고 방송 통신 위원회 또는 한국인터넷진흥원에 신 고 합니다.
      <br />
      1. 유출 등이 된 개인정보 항목
      <br />
      2. 유출 등이 발생한 시점
      <br />
      3. 이용자가 취할 수 있는 조치
      <br />
      4. 정보 통신 서비스 제공자 등의 대응 조치
      <br />
      <br />
      <h3 className="text-black">제17조 (개인정보 유출 등에 대한 조치의 예외)</h3>
      회사는 전조에도 불구하고 이용자의 연락처를 알 수 없는 등 정당한 사유가 있는 경우에는 서비스 내에 30일 이상
      게시하는 방법으로 전 조의 통지를 갈음하는 조치를 취할 수 있습니다.
      <br />
      <br />
      <h3 className="text-black">제18조 (회사의 개인정보 보호 책임자 지정)</h3>
      1. 회사는 이용자의 개인정보를 보호하고 개인 정보와 관련한 불만을 처리하기 위하여 아래와 같이 관련 부서 및 개인정보
      보호 책임자를 지정하고 있습니다.
      <br />
      가. 개인정보 보호 책임자
      <br />
      1) 성명: 김아람
      <br />
      2) 전화번호: 010-7323-5132
      <br />
      3) 이메일: arama1004@naver.com
      <br />
      <br />
      <h3 className="text-black">제19조 (권익 침해에 대한 구제 방법)</h3>
      정보 주체는 개인정보 침해로 인한 구제를 받기 위하여 개인정보분쟁조정위원회, 한국인터넷진흥원, 개인정보침해신고센터
      등에 분쟁 해결이나 상담 등을 신청할 수 있습니다. 이밖에 개인정보침해의 신고, 상담에 대해서는 아래의 기관에
      문의하시기 바랍니다.
      <br />
      가. 개인정보분쟁조정위원회: (국번 없이) 1833-6972
      <br />
      나. 개인정보침해신고센터: (국번 없이) 118
      <br />
      <br />
      <h3 className="text-black">제20조 (기타)</h3>
      1. 본 방침은 2024.07.29.부터 시행됩니다.
    </>
  );
}
